## Scratch: app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.forms_s3 will be created
  + resource "aws_iam_policy" "forms_s3" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "formsS3Access"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::forms-scratch-reliability-file-storage/*",
                          + "arn:aws:s3:::forms-scratch-reliability-file-storage",
                        ]
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags      = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role_policy_attachment.s3_forms will be created
  + resource "aws_iam_role_policy_attachment" "s3_forms" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "form-viewer"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

9 tests, 9 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
